In [1]:
import pandas as pd

In [4]:
bankdata = pd.read_csv('bank-data.csv')

In [5]:
bankdata

     age            job  marital    y
0     20        student   single  yes
1     32     management   single  yes
2     49     technician  married  yes
3     32    blue-collar  married  yes
4     33     management  married  yes
..   ...            ...      ...  ...
442   26     technician   single  yes
443   60  self-employed  married  yes
444   42    blue-collar   single  yes
445   32         admin.   single  yes
446   46    blue-collar  married  yes

[447 rows x 4 columns]

In [41]:
print("List of Eligible Clients", bankdata[(bankdata['age'] > 30) & (bankdata['age'] < 35) & (bankdata['marital'] == 'married') & (bankdata['job'] == 'management')])

List of Eligible Clients      age         job  marital    y
4     33  management  married  yes
79    34  management  married  yes
92    34  management  married  yes
118   33  management  married  yes
129   31  management  married  yes
145   31  management  married  yes
184   31  management  married  yes
220   33  management  married  yes
232   34  management  married  yes
257   31  management  married  yes
258   33  management  married  yes
268   31  management  married  yes
292   32  management  married  yes
364   31  management  married  yes
393   34  management  married  yes
413   34  management  married  yes

In [43]:
finallist = bankdata[(bankdata['age'] > 30) & (bankdata['age'] < 35) & (bankdata['marital'] == 'married') & (bankdata['job'] == 'management')]

In [44]:
finallist

     age         job  marital    y
4     33  management  married  yes
79    34  management  married  yes
92    34  management  married  yes
118   33  management  married  yes
129   31  management  married  yes
145   31  management  married  yes
184   31  management  married  yes
220   33  management  married  yes
232   34  management  married  yes
257   31  management  married  yes
258   33  management  married  yes
268   31  management  married  yes
292   32  management  married  yes
364   31  management  married  yes
393   34  management  married  yes
413   34  management  married  yes

In [45]:
len(finallist)

16

In [57]:
print('''Below is the list of ''', len(finallist), '''clients who work in Management Category\n
and are in age range of 30 to 35\n
and also are married''', "\n\n\n", finallist)

Below is the list of  16 client who work in Management Category

and are in age range of 30 to 35

and also are married


      age         job  marital    y
4     33  management  married  yes
79    34  management  married  yes
92    34  management  married  yes
118   33  management  married  yes
129   31  management  married  yes
145   31  management  married  yes
184   31  management  married  yes
220   33  management  married  yes
232   34  management  married  yes
257   31  management  married  yes
258   33  management  married  yes
268   31  management  married  yes
292   32  management  married  yes
364   31  management  married  yes
393   34  management  married  yes
413   34  management  married  yes

In [ ]:
# Tasks Performed - Imported the CSV file,

# sorted the data for age range of 30 to 35,
# sorted it for mangement category
# sorted it for marital status

# reason for selecting this variable being;
# their age bracket shows they are well educated as at a small age of 30-35 they are working in management role,
# and as working in management role their earning will be fair enough for repayment of loan,
# lastly they being married, they seek stability in their life, and not to become defaulters.

# This makes them the ideal candidate for loan!

In [58]:
import math

In [59]:
age_max = bankdata['age'].max()

In [60]:
age_min = bankdata['age'].min()

In [61]:
age_mean = bankdata['age'].mean()

In [78]:
print('Maximum Age: ',age_max, '\n','Minimum Age: ', age_min, '\n','Age Mean Value: ', age_mean)

Maximum Age:  80
 Minimum Age:  19
 Age Mean Value:  39.41387024608501

In [81]:
Age = int(input("Please Enter Age: "))
Job = str(input("Enter Job Role \n"
                "M for Management\n"
                "BC for Blue Collar\n"
                "S for Student\n"
                "T for technician\n"
                "SE for Self-Employed\n"
                "A for Administration\n"
                ">>>"))
marital = str(input("Marital Status \n"
                "M for Married\n"
                "S for Single\n"
                "D for Divorsed\n"
                ">>>"))

if Age >=35:
    print("You are eligible for loan")
    if Age <=30:
        print("Your Age is below accepted Age range")
elif Job == "M":
    print("You are eligible for loan")
    if Job != "M":
        print("Your Age is below accepted Age range")
elif marital == "M":
    print("You are eligible for loan")
    if marital != "M":
        print("Applicant must be Married")
else:
    print("Sorry! You are not Eligible for Loan")

Please Enter Age: 29
Enter Job Role
M for Management
BC for Blue Collar
S for Student
T for technician
SE for Self-Employed
A for Administration
>>>BC
Marital Status
M for Married
S for Single
D for Divorsed
>>>D
Sorry! You are not Eligible for Loan